{
  "language": "Language",
  "languages": {
    "en": "English",
    "ja": "Japanese"
  },
  "HeroSection": {
    "title": "Welcome to my page",
    "subtitle": "I am Scarlet, a software developer"
  },
  "AppOverview": {
    "title": "Apps Developed So Far",
    "apps": [
      {
        "icon": "/scarlet.png",
        "title": "Scarlet Portfolio",
        "description": "Developed as a hobby",
        "content": "The stars floating in the background of this webpage are not a video, but rather 5,000 stars randomly placed and rendered in real-time. About 15% of them are colored stars, adding vibrancy to the background.\nThe source code is publicly available on GitHub, so please take a look if you're interested.",
        "url": "https://github.com/Scarlet1107/scarlet7"
      },
      {
        "icon": "/sugoi-mojisu-counter.png",
        "title": "Sugoi Mojisu Counter",
        "description": "Developed as a hobby",
        "content": "You can count the characters you input.\nYou can set a target number of characters and visualize how close you are to the target.\nIt also has AI that provides free advice on the text you input.",
        "url": "https://app.scarlet7.net/word-counter"
      },
      {
        "icon": "/tire-quotation-app.jpg",
        "title": "Tire Quotation App",
        "description": "Developed for work",
        "content": "I developed this as an internal app after hearing from the president of a local car company that creating quotations in Excel every time was a hassle.\nBy pre-entering tire information into a database and performing conditional searches, anyone can create quotations with the same quality without making mistakes in the amount.",
        "url": "https://tire.scarlet7.net/"
      },
      {
        "icon": "/menhera-todo.png",
        "title": "Menhera Todo",
        "description": "Hackathon project",
        "content": "“Menhera todo” is an app that won first prize at a hackathon with the theme “Goofy Todo App.” You manage tasks alongside a needy girl named Hera-chan: completing tasks raises her affection, while neglecting or deleting them lowers it—eventually triggering a “bad end” with forced account deletion. It’s chaotic but just about usable.",
        "url": "https://menhera-todo.scarlet7.net/"
      },
      {
        "icon": "/paradia.png",
        "title": "Paradia",
        "description": "Hackathon project",
        "content": "Paradia is an SNS-style app that won first prize at the Supporters Geek Sai Hackathon. It’s built on a theme of contradiction: on the surface it looks like a happy utopia, but behind the scenes it’s a dark world with complete information control. Every post is checked and rewritten by the AI “Ordina,” and any negative content is erased. A simple, clear UI pulls users into this unique setting immediately.",
        "url": "https://paradia.scarlet7.net/"
      }
    ]
  },
  "TechStack": {
    "title": "Tech Stack",
    "all": "All",
    "frontend": "Frontend",
    "backend": "Backend",
    "languages": "Languages",
    "cloud": "Cloud",
    "advanced": "Advanced",
    "intermediate": "Intermediate",
    "beginner": "Beginner"
  },
  "About": {
    "title": "About Me",
    "greeting": "Hi, I'm Scarlet.",
    "content": "I'm a web engineer focused on developing web applications. I primarily use React, Next.js, and TypeScript to create user-friendly applications.\nI enjoy coding as a hobby while also taking on freelance projects and have experience launching a SaaS product at a startup. I'm always exploring new technologies and striving to build better products.\nI have published the app I developed on GitHub, so feel free to check it out!"
  },
  "Contact": {
    "title": "Contact",
    "content": "Feel free to contact me if you have any questions or suggestions.",
    "sending...": "Sending...",
    "send": "Send",
    "Send Message": "Send Message",
    "Confirm Your Message": "Confirm Your Message",
    "Name": "Name",
    "Email": "Email",
    "Message": "Message",
    "Cancel": "Cancel",
    "Confirm and Send": "Confirm and Send"
  }
}
